plattformevaluationstm32mp1/phyboardsargas/CortexM4Firmware/Projects/STM32MP15-phyBOARD-Sargas/Examples/UART/UART_Receive_Transmit_Console/STM32CubeIDE/CM4/Application/Startup/startup_stm32mp157cacx.s
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	0                          			/* Reserved                                               */
  .word	DDRPERFM_IRQHandler        			/* DDR performance monitor interrupt                      */

/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/

  	.weak	NMI_Handler
	.thumb_set NMI_Handler,Default_Handler

  	.weak	HardFault_Handler
	.thumb_set HardFault_Handler,Default_Handler

  	.weak	MemManage_Handler
	.thumb_set MemManage_Handler,Default_Handler

  	.weak	BusFault_Handler
	.thumb_set BusFault_Handler,Default_Handler

	.weak	UsageFault_Handler
	.thumb_set UsageFault_Handler,Default_Handler

	.weak	SVC_Handler
	.thumb_set SVC_Handler,Default_Handler

	.weak	DebugMon_Handler
	.thumb_set DebugMon_Handler,Default_Handler

	.weak	PendSV_Handler
	.thumb_set PendSV_Handler,Default_Handler

	.weak	SysTick_Handler
	.thumb_set SysTick_Handler,Default_Handler

	.weak	WWDG1_IT_IRQHandler
	.thumb_set WWDG1_IT_IRQHandler,Default_Handler

	.weak	PVD_AVD_IRQHandler
	.thumb_set PVD_AVD_IRQHandler,Default_Handler

	.weak	TAMP_IRQHandler
	.thumb_set TAMP_IRQHandler,Default_Handler

	.weak	RTC_WKUP_ALARM_IRQHandler
	.thumb_set RTC_WKUP_ALARM_IRQHandler,Default_Handler

	.weak	TZC_IT_IRQHandler
	.thumb_set TZC_IT_IRQHandler,Default_Handler

	.weak	RCC_IRQHandler
	.thumb_set RCC_IRQHandler,Default_Handler

	.weak	EXTI0_IRQHandler
	.thumb_set EXTI0_IRQHandler,Default_Handler

	.weak	EXTI1_IRQHandler
	.thumb_set EXTI1_IRQHandler,Default_Handler

	.weak	EXTI2_IRQHandler
	.thumb_set EXTI2_IRQHandler,Default_Handler

	.weak	EXTI3_IRQHandler
	.thumb_set EXTI3_IRQHandler,Default_Handler

	.weak	EXTI4_IRQHandler
	.thumb_set EXTI4_IRQHandler,Default_Handler

	.weak	DMA1_STR0_IRQHandler
	.thumb_set DMA1_STR0_IRQHandler,Default_Handler

	.weak	DMA1_STR1_IRQHandler
	.thumb_set DMA1_STR1_IRQHandler,Default_Handler

	.weak	DMA1_STR2_IRQHandler
	.thumb_set DMA1_STR2_IRQHandler,Default_Handler

	.weak	DMA1_STR3_IRQHandler
	.thumb_set DMA1_STR3_IRQHandler,Default_Handler

	.weak	DMA1_STR4_IRQHandler
	.thumb_set DMA1_STR4_IRQHandler,Default_Handler

	.weak	DMA1_STR5_IRQHandler
	.thumb_set DMA1_STR5_IRQHandler,Default_Handler

	.weak	DMA1_STR6_IRQHandler
	.thumb_set DMA1_STR6_IRQHandler,Default_Handler

	.weak	ADC1_IRQHandler
	.thumb_set ADC1_IRQHandler,Default_Handler

	.weak	FDCAN1_IT0_IRQHandler
	.thumb_set FDCAN1_IT0_IRQHandler,Default_Handler

	.weak	FDCAN2_IT0_IRQHandler
	.thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

	.weak	FDCAN1_IT1_IRQHandler
	.thumb_set FDCAN1_IT1_IRQHandler,Default_Handler

	.weak	FDCAN2_IT1_IRQHandler
	.thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

	.weak	EXTI5_IRQHandler
	.thumb_set EXTI5_IRQHandler,Default_Handler

	.weak	TIM1_BRK_IRQHandler
	.thumb_set TIM1_BRK_IRQHandler,Default_Handler

	.weak	TIM1_UP_IRQHandler
	.thumb_set TIM1_UP_IRQHandler,Default_Handler

	.weak	TIM1_TRG_COM_IRQHandler
	.thumb_set TIM1_TRG_COM_IRQHandler,Default_Handler

	.weak	TIM1_CC_IRQHandler
	.thumb_set TIM1_CC_IRQHandler,Default_Handler

	.weak	TIM2_IRQHandler
	.thumb_set TIM2_IRQHandler,Default_Handler

	.weak	TIM3_IRQHandler
	.thumb_set TIM3_IRQHandler,Default_Handler

	.weak	TIM4_IRQHandler
	.thumb_set TIM4_IRQHandler,Default_Handler

	.weak	I2C1_EVT_IRQHandler
	.thumb_set I2C1_EVT_IRQHandler,Default_Handler

	.weak	I2C1_ERR_IRQHandler
	.thumb_set I2C1_ERR_IRQHandler,Default_Handler

	.weak	I2C2_EVT_IRQHandler
	.thumb_set I2C2_EVT_IRQHandler,Default_Handler

	.weak	I2C2_ERR_IRQHandler
	.thumb_set I2C2_ERR_IRQHandler,Default_Handler

	.weak	SPI1_IRQHandler
	.thumb_set SPI1_IRQHandler,Default_Handler

	.weak	SPI2_IRQHandler
	.thumb_set SPI2_IRQHandler,Default_Handler

	.weak	USART1_IRQHandler
	.thumb_set USART1_IRQHandler,Default_Handler

	.weak	USART2_IRQHandler
	.thumb_set USART2_IRQHandler,Default_Handler

	.weak	USART3_IRQHandler
	.thumb_set USART3_IRQHandler,Default_Handler

	.weak	EXTI10_IRQHandler
	.thumb_set EXTI10_IRQHandler,Default_Handler

	.weak	RTC_TS_IRQHandler
	.thumb_set RTC_TS_IRQHandler,Default_Handler

	.weak	EXTI11_IRQHandler
	.thumb_set EXTI11_IRQHandler,Default_Handler

	.weak	TIM8_BRK_IRQHandler
	.thumb_set TIM8_BRK_IRQHandler,Default_Handler

	.weak	TIM8_UP_IRQHandler
	.thumb_set TIM8_UP_IRQHandler,Default_Handler

	.weak	TIM8_TRG_COM_IRQHandler
	.thumb_set TIM8_TRG_COM_IRQHandler,Default_Handler

	.weak	TIM8_CC_IRQHandler
	.thumb_set TIM8_CC_IRQHandler,Default_Handler

	.weak	DMA1_STR7_IRQHandler
	.thumb_set DMA1_STR7_IRQHandler,Default_Handler

	.weak	FMC_IRQHandler
	.thumb_set FMC_IRQHandler,Default_Handler

	.weak	SDMMC1_IRQHandler
	.thumb_set SDMMC1_IRQHandler,Default_Handler

	.weak	TIM5_IRQHandler
	.thumb_set TIM5_IRQHandler,Default_Handler

	.weak	SPI3_IRQHandler
	.thumb_set SPI3_IRQHandler,Default_Handler

	.weak	USART4_IRQHandler
	.thumb_set USART4_IRQHandler,Default_Handler

	.weak	USART5_IRQHandler
	.thumb_set USART5_IRQHandler,Default_Handler

	.weak	TIM6_IRQHandler
	.thumb_set TIM6_IRQHandler,Default_Handler

