plattformevaluationstm32mp1/phyboardsargas/CortexM4Firmware/Projects/STM32MP15-phyBOARD-Sargas/Examples/UART/UART_Receive_Transmit_Console/STM32CubeIDE/CM4/Application/Startup/startup_stm32mp157cacx.s
	.weak	TIM7_IRQHandler
	.thumb_set TIM7_IRQHandler,Default_Handler

	.weak	DMA2_STR0_IRQHandler
	.thumb_set DMA2_STR0_IRQHandler,Default_Handler

	.weak	DMA2_STR1_IRQHandler
	.thumb_set DMA2_STR1_IRQHandler,Default_Handler

	.weak	DMA2_STR2_IRQHandler
	.thumb_set DMA2_STR2_IRQHandler,Default_Handler

	.weak	DMA2_STR3_IRQHandler
	.thumb_set DMA2_STR3_IRQHandler,Default_Handler

	.weak	DMA2_STR4_IRQHandler
	.thumb_set DMA2_STR4_IRQHandler,Default_Handler

	.weak	ETH1_IRQHandler
	.thumb_set ETH1_IRQHandler,Default_Handler

	.weak	ETH1_WKUP_IRQHandler
	.thumb_set ETH1_WKUP_IRQHandler,Default_Handler

	.weak	EXTI6_IRQHandler
	.thumb_set EXTI6_IRQHandler,Default_Handler

	.weak	EXTI7_IRQHandler
	.thumb_set EXTI7_IRQHandler,Default_Handler

	.weak	EXTI8_IRQHandler
	.thumb_set EXTI8_IRQHandler,Default_Handler

	.weak	EXTI9_IRQHandler
	.thumb_set EXTI9_IRQHandler,Default_Handler

	.weak	DMA2_STR5_IRQHandler
	.thumb_set DMA2_STR5_IRQHandler,Default_Handler

	.weak	DMA2_STR6_IRQHandler
	.thumb_set DMA2_STR6_IRQHandler,Default_Handler

	.weak	DMA2_STR7_IRQHandler
	.thumb_set DMA2_STR7_IRQHandler,Default_Handler

	.weak	USART6_IRQHandler
	.thumb_set USART6_IRQHandler,Default_Handler

	.weak	I2C3_EVT_IRQHandler
	.thumb_set I2C3_EVT_IRQHandler,Default_Handler

	.weak	I2C3_ERR_IRQHandler
	.thumb_set I2C3_ERR_IRQHandler,Default_Handler

	.weak	EXTI12_IRQHandler
	.thumb_set EXTI12_IRQHandler,Default_Handler

	.weak	EXTI13_IRQHandler
	.thumb_set EXTI13_IRQHandler,Default_Handler

	.weak	DCMI_IRQHandler
	.thumb_set DCMI_IRQHandler,Default_Handler

	.weak	CRYP1_IRQHandler
	.thumb_set CRYP1_IRQHandler,Default_Handler

	.weak	HASH1_IRQHandler
	.thumb_set HASH1_IRQHandler,Default_Handler

	.weak	USART7_IRQHandler
	.thumb_set USART7_IRQHandler,Default_Handler

	.weak	USART8_IRQHandler
	.thumb_set USART8_IRQHandler,Default_Handler

	.weak	SPI4_IRQHandler
	.thumb_set SPI4_IRQHandler,Default_Handler

	.weak	SPI5_IRQHandler
	.thumb_set SPI5_IRQHandler,Default_Handler

	.weak	SPI6_IRQHandler
	.thumb_set SPI6_IRQHandler,Default_Handler

	.weak	SAI1_IRQHandler
	.thumb_set SAI1_IRQHandler,Default_Handler

	.weak	LTDC_IRQHandler
	.thumb_set LTDC_IRQHandler,Default_Handler

	.weak	LTDC_ER_IRQHandler
	.thumb_set LTDC_ER_IRQHandler,Default_Handler

	.weak	ADC2_IRQHandler
	.thumb_set ADC2_IRQHandler,Default_Handler

	.weak	SAI2_IRQHandler
	.thumb_set SAI2_IRQHandler,Default_Handler

	.weak	QUADSPI_IRQHandler
	.thumb_set QUADSPI_IRQHandler,Default_Handler

	.weak	LPTIM1_IRQHandler
	.thumb_set LPTIM1_IRQHandler,Default_Handler

	.weak	CEC_IRQHandler
	.thumb_set CEC_IRQHandler,Default_Handler

	.weak	I2C4_EVT_IRQHandler
	.thumb_set I2C4_EVT_IRQHandler,Default_Handler

	.weak	I2C4_ERR_IRQHandler
	.thumb_set I2C4_ERR_IRQHandler,Default_Handler

	.weak	SPDIFRX_IRQHandler
	.thumb_set SPDIFRX_IRQHandler,Default_Handler

	.weak	OTG_IRQHandler
	.thumb_set OTG_IRQHandler,Default_Handler

	.weak	IPCC_RX0_IRQHandler
	.thumb_set IPCC_RX0_IRQHandler,Default_Handler

	.weak	IPCC_TX0_IRQHandler
	.thumb_set IPCC_TX0_IRQHandler,Default_Handler

	.weak	DMAMUX1_OVR_REQ_IRQHandler
	.thumb_set DMAMUX1_OVR_REQ_IRQHandler,Default_Handler

	.weak	IPCC_RX1_IRQHandler
	.thumb_set IPCC_RX1_IRQHandler,Default_Handler

	.weak	IPCC_TX1_IRQHandler
	.thumb_set IPCC_TX1_IRQHandler,Default_Handler

	.weak	CRYP2_IRQHandler
	.thumb_set CRYP2_IRQHandler,Default_Handler

	.weak	HASH2_IRQHandler
	.thumb_set HASH2_IRQHandler,Default_Handler

	.weak	I2C5_EVT_IRQHandler
	.thumb_set I2C5_EVT_IRQHandler,Default_Handler

	.weak	I2C5_ERR_IRQHandler
	.thumb_set I2C5_ERR_IRQHandler,Default_Handler

	.weak	DFSDM1_FLT0_IRQHandler
	.thumb_set DFSDM1_FLT0_IRQHandler,Default_Handler

	.weak	DFSDM1_FLT1_IRQHandler
	.thumb_set DFSDM1_FLT1_IRQHandler,Default_Handler

	.weak	DFSDM1_FLT2_IRQHandler
	.thumb_set DFSDM1_FLT2_IRQHandler,Default_Handler

	.weak	DFSDM1_FLT3_IRQHandler
	.thumb_set DFSDM1_FLT3_IRQHandler,Default_Handler

	.weak	SAI3_IRQHandler
	.thumb_set SAI3_IRQHandler,Default_Handler

	.weak	DFSDM1_FLT4_IRQHandler
	.thumb_set DFSDM1_FLT4_IRQHandler,Default_Handler

	.weak	TIM15_IRQHandler
	.thumb_set TIM15_IRQHandler,Default_Handler

	.weak	TIM16_IRQHandler
	.thumb_set TIM16_IRQHandler,Default_Handler

	.weak	TIM17_IRQHandler
	.thumb_set TIM17_IRQHandler,Default_Handler

	.weak	TIM12_IRQHandler
	.thumb_set TIM12_IRQHandler,Default_Handler

	.weak	MDIOS_IRQHandler
	.thumb_set MDIOS_IRQHandler,Default_Handler

	.weak	EXTI14_IRQHandler
	.thumb_set EXTI14_IRQHandler,Default_Handler

	.weak	MDMA_IRQHandler
	.thumb_set MDMA_IRQHandler,Default_Handler

	.weak	DSI_IRQHandler
	.thumb_set DSI_IRQHandler,Default_Handler

	.weak	SDMMC2_IRQHandler
	.thumb_set SDMMC2_IRQHandler,Default_Handler

	.weak	HSEM_IT2_IRQHandler
	.thumb_set HSEM_IT2_IRQHandler,Default_Handler

	.weak	DFSDM1_FLT5_IRQHandler
	.thumb_set DFSDM1_FLT5_IRQHandler,Default_Handler

	.weak	EXTI15_IRQHandler
	.thumb_set EXTI15_IRQHandler,Default_Handler

	.weak	TIM13_IRQHandler
	.thumb_set TIM13_IRQHandler,Default_Handler

	.weak	TIM14_IRQHandler
	.thumb_set TIM14_IRQHandler,Default_Handler

	.weak	DAC_IRQHandler
	.thumb_set DAC_IRQHandler,Default_Handler

	.weak	RNG1_IRQHandler
	.thumb_set RNG1_IRQHandler,Default_Handler

	.weak	RNG2_IRQHandler
	.thumb_set RNG2_IRQHandler,Default_Handler

	.weak	I2C6_EVT_IRQHandler
	.thumb_set I2C6_EVT_IRQHandler,Default_Handler

	.weak	I2C6_ERR_IRQHandler
	.thumb_set I2C6_ERR_IRQHandler,Default_Handler

	.weak	SDMMC3_IRQHandler
	.thumb_set SDMMC3_IRQHandler,Default_Handler

	.weak	LPTIM2_IRQHandler
	.thumb_set LPTIM2_IRQHandler,Default_Handler

	.weak	LPTIM3_IRQHandler
	.thumb_set LPTIM3_IRQHandler,Default_Handler

	.weak	LPTIM4_IRQHandler
	.thumb_set LPTIM4_IRQHandler,Default_Handler

	.weak	LPTIM5_IRQHandler
	.thumb_set LPTIM5_IRQHandler,Default_Handler

	.weak	ETH1_LPI_IRQHandler
	.thumb_set ETH1_LPI_IRQHandler,Default_Handler

	.weak	RCC_WAKEUP_IRQHandler
	.thumb_set RCC_WAKEUP_IRQHandler,Default_Handler

	.weak	SAI4_IRQHandler
	.thumb_set SAI4_IRQHandler,Default_Handler

	.weak	DTS_IRQHandler
	.thumb_set DTS_IRQHandler,Default_Handler

	.weak	IWDG1_IT_IRQHandler
	.thumb_set IWDG1_IT_IRQHandler,Default_Handler

	.weak	IWDG2_IT_IRQHandler
	.thumb_set IWDG2_IT_IRQHandler,Default_Handler

	.weak	TAMP_S_IRQHandler
	.thumb_set TAMP_S_IRQHandler,Default_Handler

	.weak	RTC_WKUP_ALARM_S_IRQHandler
	.thumb_set RTC_WKUP_ALARM_S_IRQHandler,Default_Handler

	.weak	RTC_TS_S_IRQHandler
	.thumb_set RTC_TS_S_IRQHandler,Default_Handler

	.weak	DDRPERFM_IRQHandler
	.thumb_set DDRPERFM_IRQHandler,Default_Handler

	.weak	SystemInit

/************************ (C) COPYRIGHT STMicroelectonics *****END OF FILE****/
